book_app/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "created_at", "updated_at", "price", "publishdate") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "date"], ["author", "b"], ["created_at", "2021-09-30 02:56:28.980735"], ["updated_at", "2021-09-30 02:56:28.980735"], ["price", "1.22"], ["publishdate", "2016-02-08"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save